freelancer 类似猪八戒
BigTable Google设计的分布式数据存储系统
代码市场

PHP技术主管

 岗位职责： 
1、配合项目经理分析设计系统架构并进行架构的搭建； 
2、负责项目跟进及管理以及核心代码的编写； 
3、负责产品功能模块的优化及团队技术成员的任务安排等工作。 

任职资格： 
1、大专及大专以上，5年以上PHP开发经验，有2年以上中大型网站开发经验； 
2、熟悉mysql数据库，掌握mysql分区、分表、集群等相关设计方案，具备mysql优化经验； 
3、熟悉memcache、redis、mongodb等常用nosql解决方案，熟练解决缓存类技术问题； 
4、熟悉Linux/Unix操作系统下进行开发，具备丰富的开发经验； 
5、熟练使用CI，Yii，ThinkPHP等一种或多种框架； 
6、具备团队合作精神及管理意识，具备责任心。


PHP工程师

岗位职责
1、负责公司后台PHP服务及接口开发工作；
2、负责公司后台服务器的维护优化工作。 
1.负责公司Web平台、移动平台开发、框架、实现工作; 
2.协助开发主管进行模块设计及文档编写,保证项目质量,并确保开发项目按时完成; 
3.负责公司核心应用系统产品升级及维护、性能优化。 
4.依据公司业务发展需要,对公司现有的业务系统进行不断完善。

任职要求
1、本科及以上学历，2年以上LNMP工作经验；
2、精通PHP，可独立编写应用程序，代码编写规范，深入了解PHP的性能最优化和安全最大化；
3、可进行主流开源PHP程序的二次开发、模板改进和系统重构；了解redis以及memcached的部署及使用；
4、熟悉数据库，精通SQL和数据结构，具有MySQL等关系型数据库开发经验；
5、熟悉常用设计模式，能通过设计优化代码结构；
6、熟悉Linux/Unix基本操作，熟悉Nginx、MySQL、PHP等软件的编译安装和调优，了解这些软件的版本差异和不同安装,运行方式及原理；
7、善于沟通，良好的团队合作精神和认真好学的工作态度。
1. 精通PHP开发,有较强的架构能力和良好代码规范,熟悉Zend、CodeIgniter、Yii等任一一种框架。 
2. 精通JavaScript/Ajax/JQuery等相关技术 
3. 熟悉GNULinux,熟悉SQL,并了解常用的SQL优化技巧;熟悉MySQL,能熟练运用。 
4.熟悉Memcached或Redis、MongoDB等NoSQL技术,有大规模系统设计和开发经验者优先 
5.学习能力强,具备良好的问题分析和解决能力,对新技术有敏感性并愿意致力于新技术研究 
6. 沟通交流能力强,乐于分享,抗压力强,良好的团队合作精神 


【加分项】
1、有中大型后台开发/调优经验者优先；
2、有即时通讯/社区后台服务经验者优先 


PHP 高级开发工程师

岗位职责
1.负责公司相关网站项目的开发、维护；
2.负责将静态页面转换为动态页面；
3.负责与JAVA实现接口联调；
4.负责核心功能的设计与实现。 
1、领导小组进行高品质的Web研发工作； 
2、确定产品的技术解决方案和开发时间评估； 
3、负责开发功能模块的设计； 
4、协同组内开发工作以及任务安排； 
5、组织团队内交流和培训以及代码评审。 
1.使用PHP语言开发高效能数据、应用服务； 
2.完成系统架构设计、数据库结构设计、业务逻辑抽象、组件封装等编码工作； 
3.后端性能优化，新功能开发。

任职要求
1、具备良好的编码规范和编程习惯；
2、熟悉OOP；
3、具有3年以上相关工作经验，有LN(A)MP架构编程经验,熟练应用php/mysql进行开发，熟悉linux和apache、nginx平台；
4、熟悉各种WEB缓存技术,熟悉大型网站构架和性能优化；
5、能独立完成PHP相关项目的研发；
6、有ThinkPHP或Codeigniter等MVC框架和Smarty等模板库开发经验者优先；
7、掌握相关web技术，具有ajax/javascript/cssml/xml等网页技术者优先考虑；如能精通DHTML、DOM、W3C标准、SEO优化为佳；
8、熟悉或了解web2.0,有在web2.0项目工作经验者优先；
9、有大数据大并发网站开发经验者优先；
10、熟悉SOA模式、有Socket开发经验者优先；
11、热爱编程，能积极主动学习，能吃苦；
12、做事认真，有责任心，有工作热情，能吃苦耐劳；
13、具备强烈的进取心、求知欲及团队合作精神与敬业精神；
14、有志于在一个优秀的公司长期稳定发展，愿意和团队一起成长。
1、三年及以上的互联网行业开发经验，相关专业本科以上学历（优秀人才者，专业和学历可适当放宽）； 
2、精通PHP或者C/C++编程语言； 
3、精通高并发,高负载技术架构； 
4、熟练的进行数据库设计和优化，至少精通一种数据库应用，精通Mysql数据库应用者优先； 
5、熟悉web架构，熟悉web应用的数据库设计； 
6、精通linux及相关系统软件配置与优化； 
7、具有良好的沟通能力和业务理解能力
1.计算机相关专业本科及以上学历，精通PHP相关主流框架； 
2.熟悉常用版本的LINUX服务器的安装、配置和调优； 
3.熟悉常用开发环境如apache、php、mysql、nginx、memcach、redis等的搭建、参数设置以及调优； 
4.精通JSON、AJAX技术和模板技术，精通css+div的页面设计以及JS脚本编写； 
5.能够快速定位和解决系统中的性能方面问题； 
6.稳定踏实、有极客精神，能够适应高强度和高压力的工作环境； 
7.2年以上知名互联网公司php开发经验。 


PHP架构师

高位技能
1)5年以上项目实施经验和管理经验，拥有B2C电商行业平台开发工作经验优先
2)精通Web开发模式，熟悉面向对象的软件设计方法，熟悉PHP模板技术或框架技术
3)精通lamp架构，精通Unix/Linux操作系统，熟悉Shell脚本编程及常用Unix管理命令
4)精通MySQL数据库应用开发，熟悉MySQL的数据库配置管理、性能优化及数据库集群技术；
5)了解分布式系统架构设计，具备大流量、大访问量、高负载环境下的系统开发及优化经验
6)具备10人以上的技术团队管理人才优先
7)具备较强的沟通与交流能力及高度责任心 


岗位职责
1、负责保障系统的开发和维护；
2、负责指导和培训开发工程师，提高开发工程师的技术能力；
3、解决技术难题，负责核心代码的编写；
4、负责网站前台系统以及活动频道系统开发；
5、参与项目需求评审，编写开发文档、计划文档；
6、控制开发产品质量，参与制定开发规范。
7、现有产品的优化、新产品的开发； 
8、改进现有框架、基础构架，提高产品质量。 


任职要求
1、计算机或相关专业本科及以上学历，5年以上PHP开发工作经验； 
2、熟悉LAMP开发环境、Web开发流程、具备软件架构设计能力； 
3、熟练掌握各种设计模式和设计原则,具有2个以上中大型分布式系统设计经验， 
4、熟悉MYSQL数据库，掌握各种调优技巧,熟悉各种Nosql者优先； 
5、熟悉Memcache/Redis、模板引擎、消息中间件、数据库中间件的原理与应用者优先； 
6、熟悉TCP/IP、HTTP协议者优先； 
7、较强的文档撰写能力,包括需求分析、总体方案、概要设计等软件文档； 
8、具备优秀的沟通能力和团队协作能力、高度的责任心。


高级工程师提问：
1，如何记录用户在线时长
2，如何更好的分配随机数
3，如何搭建一个高性能的web服务器
4，如何避免别人刷短信验证码
5，发布版本时，如何来避免用户在客户端缓存css、js等资源？说出解决方案
6，如何防止网站被恶意刷
7，如何快速的搜索大分类下面的产品数据
8，如何更好的进行敏捷开发
9，ajax请求提交，如何防重复提交
10，数据库的删除是做物理删除比较好还是做逻辑删除好？
11，如何更新线上多台服务器的php代码
12，在电子商务中常有绑定销售会优惠一定金额的促销，比如：a商品100元，b商品80元，如果单独购买ab商品需要180元，如果后台设置优惠促销，一起购买ab商品可以减10元，即一起购买ab商品只需170元
（1）问题1：假如后台有1000+种绑定销售套餐，其中：a+b减少5元，a+b+c减少8元；如果用户同时购买了abc商品，如何快速求出用户此单需要优惠的金额？（需考虑性能问题）
（2）问题2：如果购物车中可以修改购买数量，购买多套套餐可以优惠多次，假如a+b+c减少10元，b+f减少5元，a+d减少5元，c+e减少5元，购买两个b我们用2b表示，
如果用户同时购买了a+2b+c+f那么我们给用户减少15元，如果用户购买了a+b+c+d+e+f，那么我们可以给用户减10元（a+b+c减10元），也可以减15元（b+f减少5元，a+d减少5元，c+e减少5元），
从用户角度来讲，当然是减15元最好了，如何求出用户此单中最大的优惠金额？（不用写程序，只用讲清楚思路即可）
（3）问题3：如果以上两个问题无法实现，请给出优化方案（提示：不限于改变购买流程和修改需求）
13，目前有个电子商务网站在Linode美国区站点，LAMP架构。选美国区站点是由于国外用户较多。
现在国内用户也变多了，但是国内访问Linode美国区站点时速度缓慢。谈谈如何让国内国外用户访问都比较快，如何优化这个问题？
14，在电子商务网站上，分类是很常见的，假如一个产品对应一个分类；问题：
（1） 设计表结构，支持无限级分类，写出表明和对应的字段
（2）如何快速的查找一个分类和其所有的子分类下的所有产品？阐述实现思路即可
（3）如果一个产品对应多个分类，那问题（2）又该如何实现？阐述需要设计的表和实现思路即可
15，请问如何实现:一段字符串中自动转换url跳转至超链接页面（如字符串中有类似http://www.baidu.com替换成<a href="http://www.baidu.com">http://www.baidu.com</a>）
16，如何反转一个字符串（需考虑中英文混合的情况）
17，什么是CSRF？如何防止伪造跨站请求[跨站点脚本攻击]？


中级工程师提问：
1，什么是mvc模式？
2，为什么使用框架？
3，你对代码规范是怎么看的？
4，项目开发分哪几个阶段，分别是什么，各自的内容包括什么？
5，列举web开发中的安全性问题？
6，mysql优化建议？
7，使用过用户版本控制工具吗？

