freelancer 类似猪八戒
BigTable Google设计的分布式数据存储系统
代码市场

PHP技术主管

 岗位职责： 
1、配合项目经理分析设计系统架构并进行架构的搭建； 
2、负责项目跟进及管理以及核心代码的编写； 
3、负责产品功能模块的优化及团队技术成员的任务安排等工作。 

任职资格： 
1、大专及大专以上，5年以上PHP开发经验，有2年以上中大型网站开发经验； 
2、熟悉mysql数据库，掌握mysql分区、分表、集群等相关设计方案，具备mysql优化经验； 
3、熟悉memcache、redis、mongodb等常用nosql解决方案，熟练解决缓存类技术问题； 
4、熟悉Linux/Unix操作系统下进行开发，具备丰富的开发经验； 
5、熟练使用CI，Yii，ThinkPHP等一种或多种框架； 
6、具备团队合作精神及管理意识，具备责任心。


PHP工程师

岗位职责
1、负责公司后台PHP服务及接口开发工作；
2、负责公司后台服务器的维护优化工作。 
1.负责公司Web平台、移动平台开发、框架、实现工作; 
2.协助开发主管进行模块设计及文档编写,保证项目质量,并确保开发项目按时完成; 
3.负责公司核心应用系统产品升级及维护、性能优化。 
4.依据公司业务发展需要,对公司现有的业务系统进行不断完善。

任职要求
1、本科及以上学历，2年以上LNMP工作经验；
2、精通PHP，可独立编写应用程序，代码编写规范，深入了解PHP的性能最优化和安全最大化；
3、可进行主流开源PHP程序的二次开发、模板改进和系统重构；了解redis以及memcached的部署及使用；
4、熟悉数据库，精通SQL和数据结构，具有MySQL等关系型数据库开发经验；
5、熟悉常用设计模式，能通过设计优化代码结构；
6、熟悉Linux/Unix基本操作，熟悉Nginx、MySQL、PHP等软件的编译安装和调优，了解这些软件的版本差异和不同安装,运行方式及原理；
7、善于沟通，良好的团队合作精神和认真好学的工作态度。
1. 精通PHP开发,有较强的架构能力和良好代码规范,熟悉Zend、CodeIgniter、Yii等任一一种框架。 
2. 精通JavaScript/Ajax/JQuery等相关技术 
3. 熟悉GNULinux,熟悉SQL,并了解常用的SQL优化技巧;熟悉MySQL,能熟练运用。 
4.熟悉Memcached或Redis、MongoDB等NoSQL技术,有大规模系统设计和开发经验者优先 
5.学习能力强,具备良好的问题分析和解决能力,对新技术有敏感性并愿意致力于新技术研究 
6. 沟通交流能力强,乐于分享,抗压力强,良好的团队合作精神 


【加分项】
1、有中大型后台开发/调优经验者优先；
2、有即时通讯/社区后台服务经验者优先 


PHP 高级开发工程师

岗位职责
1.负责公司相关网站项目的开发、维护；
2.负责将静态页面转换为动态页面；
3.负责与JAVA实现接口联调；
4.负责核心功能的设计与实现。 
1、领导小组进行高品质的Web研发工作； 
2、确定产品的技术解决方案和开发时间评估； 
3、负责开发功能模块的设计； 
4、协同组内开发工作以及任务安排； 
5、组织团队内交流和培训以及代码评审。 
1.使用PHP语言开发高效能数据、应用服务； 
2.完成系统架构设计、数据库结构设计、业务逻辑抽象、组件封装等编码工作； 
3.后端性能优化，新功能开发。

任职要求
1、具备良好的编码规范和编程习惯；
2、熟悉OOP；
3、具有3年以上相关工作经验，有LN(A)MP架构编程经验,熟练应用php/mysql进行开发，熟悉linux和apache、nginx平台；
4、熟悉各种WEB缓存技术,熟悉大型网站构架和性能优化；
5、能独立完成PHP相关项目的研发；
6、有ThinkPHP或Codeigniter等MVC框架和Smarty等模板库开发经验者优先；
7、掌握相关web技术，具有ajax/javascript/cssml/xml等网页技术者优先考虑；如能精通DHTML、DOM、W3C标准、SEO优化为佳；
8、熟悉或了解web2.0,有在web2.0项目工作经验者优先；
9、有大数据大并发网站开发经验者优先；
10、熟悉SOA模式、有Socket开发经验者优先；
11、热爱编程，能积极主动学习，能吃苦；
12、做事认真，有责任心，有工作热情，能吃苦耐劳；
13、具备强烈的进取心、求知欲及团队合作精神与敬业精神；
14、有志于在一个优秀的公司长期稳定发展，愿意和团队一起成长。
1、三年及以上的互联网行业开发经验，相关专业本科以上学历（优秀人才者，专业和学历可适当放宽）； 
2、精通PHP或者C/C++编程语言； 
3、精通高并发,高负载技术架构； 
4、熟练的进行数据库设计和优化，至少精通一种数据库应用，精通Mysql数据库应用者优先； 
5、熟悉web架构，熟悉web应用的数据库设计； 
6、精通linux及相关系统软件配置与优化； 
7、具有良好的沟通能力和业务理解能力
1.计算机相关专业本科及以上学历，精通PHP相关主流框架； 
2.熟悉常用版本的LINUX服务器的安装、配置和调优； 
3.熟悉常用开发环境如apache、php、mysql、nginx、memcach、redis等的搭建、参数设置以及调优； 
4.精通JSON、AJAX技术和模板技术，精通css+div的页面设计以及JS脚本编写； 
5.能够快速定位和解决系统中的性能方面问题； 
6.稳定踏实、有极客精神，能够适应高强度和高压力的工作环境； 
7.2年以上知名互联网公司php开发经验。 


PHP架构师

高位技能
1)5年以上项目实施经验和管理经验，拥有B2C电商行业平台开发工作经验优先
2)精通Web开发模式，熟悉面向对象的软件设计方法，熟悉PHP模板技术或框架技术
3)精通lamp架构，精通Unix/Linux操作系统，熟悉Shell脚本编程及常用Unix管理命令
4)精通MySQL数据库应用开发，熟悉MySQL的数据库配置管理、性能优化及数据库集群技术；
5)了解分布式系统架构设计，具备大流量、大访问量、高负载环境下的系统开发及优化经验
6)具备10人以上的技术团队管理人才优先
7)具备较强的沟通与交流能力及高度责任心 
